/* In browser window title */
"Get a donation key!" = "Получете ключ на дарител!";

/* The full name of the supporter */
"Registered to {0}" = "Регистриран на {0}";

/* Cyberduck is open source software */
"Thanks for your support! Your contribution helps to further advance development to make Cyberduck even better." = "Благодарности за вашата подкрепа. Вашият принос подпомага по-нататъшното развитие и подобрение на програмата.";

/* Copy of donation key */
"Your donation key has been copied to the Application Support folder." = "Вашият дарителски ключ беше копиран в папка „Application Support”.";

/* Validation failed */
"Not a valid donation key" = "Невалиден дарителски ключ";

"This donation key does not appear to be valid." = "Този дарителски ключ изглежда невалиден.";

/* Thank you */
"Continue" = "Продължение";
/* Validation failed */
"Not a valid donation key" = "Невалиден дарителски ключ";

"This donation key does not appear to be valid." = "Този дарителски ключ изглежда невалиден.";

/* Thank you */
"Continue" = "Продължение";